app/controllers/camps_controller.rb

    def set_camp
      @camp = Camp.find(params[:id])
---
SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT ?